In [1]:
import pandas as pd

###`Q-1:` You are given a Multi index DataFrame. You task is to swap level-0 index with level-0 column.
* Change Branch -> ('cse', 'ece') as columns at level-0 and ('delhi'	'mumbai') as level-0 Index
* And Sort on row index level-0

In [2]:
# Given Code Snippets
index_val = [('cse',2019),('cse',2020),('cse',2021),('cse',2022),('ece',2019),('ece',2020),('ece',2021),('ece',2022)]
multiindex = pd.MultiIndex.from_tuples(index_val)
df = pd.DataFrame(
    [
        [1,2,0,0],
        [3,4,0,0],
        [5,6,0,0],
        [7,8,0,0],
        [9,10,0,0],
        [11,12,0,0],
        [13,14,0,0],
        [15,16,0,0],
    ],
    index = multiindex,
    columns = pd.MultiIndex.from_product([['delhi','mumbai'],['avg_package','students']])
)

df

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [14]:
df.unstack().swaplevel(axis=1).stack().transpose()

C:\Users\panka\AppData\Local\Temp\ipykernel_49236\1482105945.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df.unstack().swaplevel(axis=1).stack().transpose()

                    cse                  ece
            avg_package students avg_package students
delhi  2019           1        2           9       10
       2020           3        4          11       12
       2021           5        6          13       14
       2022           7        8          15       16
mumbai 2019           0        0           0        0
       2020           0        0           0        0
       2021           0        0           0        0
       2022           0        0           0        0

###`Q-2:` Covid Cases Data Set Problem
 Make a DataFrame Using both Covid Dataset. With Country name as Level-0 and Provinance/State as Level-1 Index and date, No of cases and No of Deaths as Columns.

In [35]:
confirm = pd.read_csv('https://docs.google.com/spreadsheets/d/e/2PACX-1vTmqT3kxd0i0RUFiEnwA1Hboiunv28MeNTatZsIEqlPPB7mHrl0ttJL7utZ23_1s5FW8ZjODmB8jHIi/pub?gid=2142019845&single=true&output=csv')

death = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vQn4nLCKIVZMw4e89YeRqgKaSAAwRFaZ6ILMW_FUejZ2tkv3Np1f9gD4QOl3ASHeLzWjOjfmLDKcCOF/pub?gid=212966958&single=true&output=csv")

In [36]:
df1=death.melt(id_vars=["Country/Region","Province/State","Lat","Long"],var_name="date",value_name="death")
df2=confirm.melt(id_vars=["Country/Region","Province/State","Lat","Long"],var_name="date",value_name="confirmed")
df1["Confirmed"]=df2["confirmed"]
df1.sort_values("Country/Region",inplace=True)
df1.reset_index(inplace=True,drop=True)
ml2=pd.MultiIndex.from_product([death["Country/Region"].values,df2["date"].unique().tolist()])
df1.set_index(ml2,inplace=True)
df1.drop(columns=["Lat","Long","Province/State","Country/Region","date"],inplace=True)
df1.head()

                     death  Confirmed
Afghanistan 1/22/20      0          0
            1/23/20    239      13102
            1/24/20   7777     192906
            1/25/20   7829     204417
            1/26/20      0         14

###`Q-3:` Show Country with Heighest death percent out of confirmed Cases.

In [37]:
s=df1["death"]/df1["Confirmed"]
s.sort_values(ascending=False)

Canada    8/23/21     inf
          8/25/21     inf
          8/31/21     inf
          2/18/21     inf
          8/5/21      inf
                     ...
Zimbabwe  11/10/22    NaN
          12/6/22     NaN
          12/7/22     NaN
          12/18/22    NaN
          12/28/22    NaN
Length: 311253, dtype: float64

### `Q-4` : Make a dataframe for India from Covid Data with one extra column representing no of new cases.

* Just for Assumption "No of new cases" will be equal to difference of "no of cases" with previous day.
* First day new cases will be NaN or equal to no of cases

Say on 12/30/22 No of cases is - 44679608	and a day previous (12/29/22) no of cases is - 44679382.

Then for 12/30/22 -> No of New Cases  = 44679608 - 44679382 =

Note:- Try using shift Function

Try using the shift function

```
s = pd.Series([1,2,3,4,5,6])
s #-> [1,2,3,4,5,6]
s.shift(1) #-> [NaN, 1,2,3,4,5]
s.shift(-1) #-> [2,3,4,5,6, NaN]
```

In [39]:
df1=df1.loc["India"]
df1

           death  Confirmed
1/22/20   500055   41952712
1/23/20   154392   10757610
1/24/20   165101   12589067
1/25/20    13699     425282
1/26/20   126611    8553657
...          ...        ...
12/29/22       0          1
12/30/22   96318    6145291
12/31/22    7750     276146
1/1/23    325972   27894800
1/2/23     71642    4204613

[1077 rows x 2 columns]

In [40]:
df1["new cases"]=df1["Confirmed"]-df1["Confirmed"].shift(-1)

C:\Users\panka\AppData\Local\Temp\ipykernel_49236\3832028829.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["new cases"]=df1["Confirmed"]-df1["Confirmed"].shift(-1)

In [41]:
df1

           death  Confirmed   new cases
1/22/20   500055   41952712  31195102.0
1/23/20   154392   10757610  -1831457.0
1/24/20   165101   12589067  12163785.0
1/25/20    13699     425282  -8128375.0
1/26/20   126611    8553657   -981307.0
...          ...        ...         ...
12/29/22       0          1  -6145290.0
12/30/22   96318    6145291   5869145.0
12/31/22    7750     276146 -27618654.0
1/1/23    325972   27894800  23690187.0
1/2/23     71642    4204613         NaN

[1077 rows x 3 columns]

### `Q-5:` Read the Dataset using the below given link and create a multi-index dataframe using the columns "Country" and "City/Town".

This dataset is about the most polluted cities in the world. You can get details from [here](https://www.kaggle.com/datasets/rajkumarpandey02/worlds-most-air-polluted-countries-cities).

**Dataset link:** https://tinyurl.com/2fe6vz4u Directly use this link to read.

**Task:**
1. Find out the name of the city of India which is most poluted based on PM10.
2. Find out the name of the city of India which has minumum pollution level based on PM10.
3. Do same operations (like 1 and 2) with the country China.
4. Make a pie chart based on the column "PM10" of the country Poland.
5. Make a bar chart based on the columns "PM2.5" and "PM10" of the countries Israel and Qatar.
6. Convert this MultiIndex DataFrame to Series by retaining the informations.

In [42]:
df=pd.read_csv("https://tinyurl.com/2fe6vz4u")
df.head()

,Unnamed: 0,Position,Country,City/Town,Year,PM2.5,Temporal coverage,PM10,Temporal coverage.1,Database version (year)
0,0,1,India,Kanpur,2016,173,>75%,319,NaN,2018
1,1,2,India,Faridabad,2016,172,>75%,316,NaN,2018
2,2,3,India,Gaya,2016,149,50% -< 75%,275,NaN,2018
3,3,4,India,Varanasi,2016,146,>75%,260,NaN,2018
4,4,5,India,Patna,2016,144,>75%,266,NaN,2018

In [48]:
df[df["Country"]=="India"][df["PM10"]==df["PM10"].max()]]["City/Town"]

Series([], Name: City/Town, dtype: object)

In [47]:
df[df["PM10"]==df["PM10"].min()]["City/Town"]

496    Siedlce
Name: City/Town, dtype: object